tutorials/catalyticZonesReactingFoam/porousMediaIsoOxidativeCouplingMethane/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    porousZone
    {
        type           explicitPorositySource;
        active         true;

        explicitPorositySourceCoeffs
        {
            type           fixedCoeff;
            selectionMode  cellZone;
            cellZone       bed;

            fixedCoeffCoeffs
            {
                alpha      [0 0 -1 0 0 0 0] (-1000 1e7 -1000);
                beta       [0 -1 0 0 0 0 0] (-1000 1e3 -1000);
                rhoRef     0.21;

                coordinateSystem
                {
                    x          (1 0 0);
                    y          (0 1 0);
                    #includeEtc "caseDicts/general/coordinateSystem/cartesianXY"
                }
            }
        }
    }
    fixedTemperature
    {
        type            fixedTemperatureConstraint;
        active          yes;
        selectionMode   all;

        mode            uniform;
        temperature     constant 1123;
    }
}

//************************************************************************** //

